package com.example.user.therailwaylinecheck;

import android.content.Intent;
import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.ArrayAdapter;
import android.widget.AutoCompleteTextView;
import android.widget.Button;



public class Fragment1 extends Fragment {
      AutoCompleteTextView autoCompTextView1,autoCompTextView2;
      ArrayAdapter<String> adapter1,adapter2;

      @Override
      public void onCreate(Bundle savedInstanceState) {
            super.onCreate(savedInstanceState);
      }

      @Override
      public View onCreateView(LayoutInflater inflater, ViewGroup container, Bundle savedInstanceState) {
            //นำ XML Layout ที่จะใช้คู่กัน  มาใช้เป็นโครงร่างของ Fragment นี้
            View view =  inflater.inflate(R.layout.fragment1, container, false);  //ใช้คู่กับ fragment1.xml

            String[] textSource = {"กบินทร์บุรี","กบินทร์เก่า","กระสัง","กระเบียด","กรุงเทพ","กลางดง","กะปาง","กะแด๊ะ","กระโดนค้อ","กันตัง","กันทรารมณ์","กาญจนบุรีย์"
                                    ,"การเคหะ","การเคหะ กม.19","กุดจิก","กุมภวาปี","กุยบุรี","ขอนแก่น","ขุนตาน","คลองกุย","คลองขนาน","คลองขนานจิตร","คลองขุด"
                                    ,"คลองจัง","คลองจันตดี","คลองจาก","คลองตัน","คลองตาคด","คลองต้น","คลองทราย","คลองบางตาล","คลองบางพระ","คลองปราบ"
                                    ,"คลองปลากด","คลองพุทรา","คลองมหาสวัสดิ์","คลองมะพลับ","คลองยัน","คลองยา","คลองยี่สิบเอ็ด","คลองรังสิต","คลองวังช้าง","คลองสูญ"
                                    ,"คลองหนึ่ง","คลองหลวงแพ่ง","คลองอุดมชลจร","คลองแขวงกลั่น","คลองแงะ","คลองไทร","คลองไผ่","ควนพระ","ควนหนองคว้า","ควนหินมุ้ย"
                                    ,"ควนเคี่ยม","ควนเนียง","คอกควาย","คันธุรี","คั่นกระได","คำกลิ้ง","คีรีรัฐนิยม","จรัลสนิทวงศ์","จอมทอง","จะนะ","จักราช","จัตุรัส"
                                    ,"ช่องแค","ช่องแคบ","ฉวาง","ชลบุรี","ชะม่วง","ชะอวด","ชัยบุรี","ชุมทางคลองสิบเก้า","ชุมทางฉะเชิงเทรา","ชุมทางตลิ่งชัน","ชุมทางถนนจิระ"
                                    ,"ชุมทางทุ่งสง","ชุมทางบัวใหญ่","ชุมทางบางซื่อ","ชุมทางบ้านดารา","ชุมทางบ้านทุ่งโพธิ์","ชุมทางบ้านภาชี","ชุมทางศีราชา","ชุมทางหนองปลาดุก"
                                    ,"ชุมทางหาดใหญ่","ชุมทางเขาชีจรรย์","ชุมทางเขาชุมทอง","ชุมทางแก่งคอย","ชุมพร","ชุมแสง","ช่องสำราญ","ช่องเขา","ช่องแค","ช่องแคบ"
                                    ,"ซอยวัดลานบุญ","ซับม่วง","ญาณสังวราราม","ดงตะขบ","ดงมะกุ","ดอนทราย","ดอนทอง","ดอนธูป","ดอนสีนนท์","ดอนหญ้านาง","ดอนเมือง"
                                    ,"ตรอน","ตรัง","ตลาดพลู","ตลาดลำนารายณ์","ตลาดใหม่ดอนเมือง","ตะพานหิน","ตันหยงมัส","ตาเชะ","ตาแปด","ต้นสำโรง","ถนนทรงพล"
                                    ,"ทะเมนชัย","ทะเลหว้า","ทับกฤช","ทับสะแก","ทาชมภู","ที่วัง","ทุ่งคา","ทุ่งทอง","ทุ่งบัว","ทุ่งประดู่","ทุ่งมะเม่า","ทุ่งสองห้อง","ทุ่งสีทอง"
                                    ,"ท่ากิเลน","ท่าฉลอม","ท่าฉาง","ท่าชนะ","ท่าช้าง","ท่าตาเสือ","ท่าทอง","ท่าพระ","ท่าสัก","ท่าฬ่อ","ท่าเกษม","ท่าเรือ","ท่าเรือน้อย"
                                    ,"ท่าเสา","ท่าแค","ท่าแฉลบ","ท่าแมงลัก","ธนบุรี","นครชัยศรี","นครชุมน์","นครปฐม","นครราชสีมา","นครลำปาง","นครศรีธรรมราช"
                                    ,"นครสวรรค์","นวนคร","นากาญจน์","นาชะอัง","นาทา","นาบอน","นาประดู่","นาปรือ","นาผักขวง","นาพู่","นาม่วง","นาสาร"
                                    ,"นิคมรถไฟ กม.11","น้ำตก","น้ำพอง","บัตเตอร์เวอร์ธ","บันไดม้า","บางกระทุ่ม","บางกระบูน","บางกระเจ้า","บางกล่ำ","บางจาก","บางน้ำจืด"
                                    ,"บางน้ำเปรี้ยว","บางบอน","บางบำหรุ","บางปะอิน","บางพระ","บางประอิน","บางมูลนาก","บางระมาด","บางละมุง","บางสะพานน้อย"
                                    ,"บางสะพานใหญ่","บางสีคต","บางเขน","บางเค็ม","บางเตย","บางแก้ว","บางโทรัด","บาลอ","บำเหน็ดณรงค์","บึงบอระเพ็ด","บึงพระ","บุรีรัมย์"
                                    ,"บุฤาษี","บุ่งหวาย","บูกิต","บ่อกรัง","บ่อนอก","บ้านกกกว้าว","บ้านกระพี้","บ้านกระโดน","บ้านกรูด","บ้านกลอย","บ้านกลับ","บ้านกล้วย"
                                    ,"บ้านกระลัน","บ้านกาหลง","บ้านขนาย","บ้านขนอม","บ้านครน","บ้านคล้อ","บ้านคอกม้า","บ้านคูบัว","บ้านค่ายไทย","บ้านจงโก","บ้านฉิมพลี"
                                    ,"บ้านชะอำ","บ้านชีผ้าขาว","บ้านช่องใต้","บ้านดงบัง","บ้านดงพลอง","บ้านดวด","บ้านดอนกลาง","บ้านดอนรัก","บ้านดอนเรียบ","บ้านดอนใหญ่"
                                    ,"บ้านดินลาน","บ้านด่าน","บ้านตรอกแค","บ้านตะโก","บ้านตาคลี","บ้านตาเนิน","บ้านตูม","บ้านตูล","บ้านต้นโดน","บ้านถ่อน","บ้านทรัพย์สมบูรณ์"
                                    ,"บ้านทรายทอง","บ้านทับช้าง","บ้านทุ่งค่าย","บ้านทุ่งหลวง","บ้านทุ่งหล่อ","บ้านท่าช้าง","บ้านนา","บ้านนาขวาง","บ้านนาหลง","บ้านนาโคก","บ้านนิคม"
                                    ,"บ้านบุ่ง","บ้านบ่อ","บ้านปลักแรด","บ้านปากจาบ","บ้านปากพลี","บ้านปาแต","บ้านปิน","บ้านป่าหวาย","บ้านป่าไก่","บ้านป๊อกแป๊ก","บ้านพรหมแสง"
                                    ,"บ้านพระพุทธ","บ้านพรุกระแชง","บ้านพลูตาหลวง","บ้านพะเนา","บ้านพุพง","บ้านมะกอกใต้","บ้านมะค่า","บ้านม้า","บ้านยาง","บ้านวะตะแบก(เทพสถิต)"
                                    ,"บ้านวังชัย","บ้านสระครก","บ้านสร้าง","บ้านสะโลว์กิ๊ตยือแร","บ้านสุนทรา","บ้านส้อง","บ้านหนองกันงา","บ้านหนองขาม","บ้านหนองตาด","บ้านหนองบัว"
                                    ,"บ้านหนองปรือโป่ง","บ้านหนองเสือ","บ้านหมอ","บ้านหมี่","บ้านหัน","บ้านหินโคน","บ้านห้วยขวาง","บ้านห้วยยูง","บ้านห้วยแตน","บ้านเกยเชน","บ้านเกาะ"
                                    ,"บ้านเกาะปริง","บ้านเกาะมุกข์","บ้านเกาะรัง","บ้านเกาะแดง","บ้านเกาะใหญ่","บ้านเก่า","บ้านเก่างิ้ว","บ้านเต็งหนาม","บ้านเนียม","บ้านเหลื่อม","บ้านแก้ง"
                                    ,"บ้านแต้","บ้านแสงพลัน","บ้านแหลม","บ้านแฮด","บ้านโคกกระเบื้อง","บ้านโคน","บ้านโนนผึ้ง","บ้านโป่ง","บ้านโป่งคอม","บ้านโป่งเสี้ยว","บ้านโพ"
                                    ,"บ้านโสกรัง","บ้านใหม่","บ้านใหม่สำโรง","บ้านไผ่","บ้านไร่","ประจวบคีรีขันธ์","ประจันตคาม","ประดิพัทธ์","ปราจีนบุรี","ปราณบุรี","ปะทิว","ปัตตานี"
                                    ,"ปากคลอง","ปากช่อง","ปากตะโก","ปากท่อ","ปากน้ำโพ","ปากปาน","ปากแพรก","ปางต้นผึ้ง","ปางป๋วย","ปางม่วง","ปางอโศก","ปาดังเบซาร์"
                                    ,"ป่าเส้า","ป่าไผ่","ป่าไร่","ผาคอ","ผาคัน","ผาเสด็จ","พญาไท","พรหมแดน","พรหมพิราม","พระจอมเกล้า","พระปรง","พระราชวังสนามจันทร์"
                                    ,"พระแก้ว","พรุพี","พลสงคราม","พัทยา","พัทยาใต้","พัทลุง","พานทอง","พิจิตร","พิชัย","พิษณุโลก","พุทธมลฑล สาย2","ภูเขาลาด"
                                    ,"ม.ธรรมศาสตร์","มวกเหล็ก","มหาชัย","มะม่วงสองต้น","มะรือโบ","มะลวน","มักกะสัน","มาบกะเบา","มาบพระจันทร์","มาบอำมฤต","ยมราช","ยะลา"
                                    ,"รังสิต","รางสะแก","รางโพธิ์","ราชบุรี","ราชปรารภ","รามัน","รือเสาะ","ร่อนพิบูลย์","ลพบุรีย์","ละแม","ลาดกระบัง","ลาดบัวขาว","ลาดใหญ่"
                                    ,"ลาโละ","ลำชี","ลำนารายณ์","ลำปลายมาศ","ลำพูน","ลุ่มสุ่ม","ลูกแก","วงเวียนใหญ่","วังกรด","วังกร่าง","วังกะพี้","วังกะอ่าม","วังก์พง"
                                    ,"วังด้วน","วังตะเคียน","วังลาน","วังวัว","วังสิงห์","วังเย็น","วังโพ","วังใหญ่","วัฒนานคร","วัดควนมีด","วัดควนเผยอ","วัดงิ้วราย","วัดช้างให้"
                                    ,"วัดสิงห์","วัดสุวรรณ","วัดไทร","วิสัย","ศรีสะเกษ","ศาลาดิน","ศาสาธรรมสพน์","ศาสาผาลาด","ศาลายา","ศาลาลำดวน","ศาลาแม่ทา","ศิลาอาสน์"
                                    ,"ศรีขรภูมิ","สระบุรี","สระแก้ว","สระโกสินารายณ์","สวนนงนุช","สวนสนประติพัทธ์","สวรรคโลก","สวี","สะพานจุฬาลงกรณ์","สะพานถ้ำกระแช"
                                    ,"สะพานแควใหญ่","สังกระทาย","สามร้อยยอด","สามเสน","สามแยก","สารภี","สำราญ","สำโรงทาบ","สีคิ้ว","สุขุมวิท 71","สุพรรณบุรี","สุรนารายณ์"
                                    ,"สุราษฎร์ธานี","สุรินทร์","สุไหงปาดี","สุไหงโก-ลก","สูงเนิน","หนองกระจับ","หนองกระทวย","หนองกระทิง","หนองขอนกว้าง","หนองคาง","หนองคาย"
                                    ,"หนองจอก","หนองจิก","หนองฉิม","หนองตม","หนองตะโก้","หนองทรายขาว","หนองน้ำขาว","หนองน้ำขุ่น","หนองบัว","หนองบัวลอย","หนองปลาไหล"
                                    ,"หนองพลวง","หนองมงคล","หนองมะเขือ","หนองมโนรมณ์","หนองวัวเฒ่า","หนองวิวัฒน์","หนองศรีวิชัย","หนองศาลา","หนองสัง","หนองสีดา","หนองหล่ม"
                                    ,"หนองหิน","หนองเต็ง","หนองเต่า","หนองเนียน","หนองแก","หนองแก","หนองแคน","หนองแซง","หนองแมว","หนองแวง","หนองโดน","หนองโพ"
                                    ,"หนอง","หนองไข่น้ำ","หนองไม้เหลือง","หลักช้าง","หลักสี่","หลักหก","หลังสวน","หว้ากอ","หอไกร","หัวงิ้ว","หัวดง","หัวตะเข้","หัวมาด"
                                    ,"หัวหมาก","หัวหวาย","หัวหิน","หารกง","หารเทา","หินกอง","หินซ้อน","หินดาษ","หินลับ","ห้วยขยุง","ห้วยขวาง","ห้วยทรายเหนือ","ห้วยทรายใต้"
                                    ,"เชียงใหม่"};
            autoCompTextView1 = (AutoCompleteTextView)view.findViewById(R.id.AutoCompTextView1);
            adapter1 = new ArrayAdapter<String>(getActivity(),android.R.layout.simple_dropdown_item_1line,textSource);
            autoCompTextView1.setAdapter(adapter1);


            autoCompTextView2 = (AutoCompleteTextView)view.findViewById(R.id.AutoCompTextView2);
            adapter2 = new ArrayAdapter<String>(getActivity(),android.R.layout.simple_dropdown_item_1line,textSource);
            autoCompTextView2.setAdapter(adapter2);

            Button button1 = (Button)view.findViewById(R.id.Button1);
            button1.setOnClickListener(new View.OnClickListener() {
                  @Override
                  public void onClick(View v) {
                        Intent intent = new Intent(getContext(), ListTrainSt.class);
                        startActivity(intent);
                  }
            });
            Button button2 = (Button)view.findViewById(R.id.Button2);
            button2.setOnClickListener(new View.OnClickListener() {
                  @Override
                  public void onClick(View v) {
                        Intent intent = new Intent(getContext(), ListTrainSt.class);
                        startActivity(intent);
                  }
            });

            return view;
      }

}